Revit 2027 API
AdvancedLayered.LayeredNdfType Property
 The property labeled "NDF" from the "AdvancedLayered" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string LayeredNdfType { get; }
Public Shared ReadOnly Property LayeredNdfType As String
	Get
public:
static property String^ LayeredNdfType {
	String^ get ();
}
static member LayeredNdfType : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "LayeredNdfType".
See Also
Reference
AdvancedLayered Class
Autodesk.Revit.DB.Visual Namespace